/*
Описать класс «Клиент банка». При этом считать, что некоторые клиенты обладают
большим приоритетом по отношению к остальным (дети, инвалиды). Для этого в классе
хранить уровень приоритета. Объявить перечисление, включающее четыре уровня
приоритета. Определить для класса операцию сравнения < . Смоделировать поведение
очереди к специалистам с помощью шаблонного класса priority_queue. Программа
должна считывать данные о приходящих клиентах из обычной очереди (шаблонный класс
queue), помещать их в приоритетную очередь и выдавать на консоль информацию о
последовательности работы с клиентами.
*/

#include<iostream>
#include"bank_customer.h"
#include"bank_customer.cpp"
#include<priority_queue>
#include<queue>

using namespace std;

int main()
{

}